"""Файл для общей замены текста кнопок клавиатуры"""

NO_CITY = 'Нет моего города'
NO_SCHOOL = 'Нет моей школы'


BACK = '⬅️ Вернуться назад'
BACK_CITY = 'Назад в город'
BACK_SCHOOL = 'Назад в школу'
BACK_SCHOOL_CLASS = 'Назад в класс'
BACK_GENDER = 'Назад в пол'


BOY = '👱‍♂️ Парень'
GIRL = '👩 Девушка'


REQUEST = '🥷 Запросы'
MY_RATE = '📫 Меня оценили'
RATE_FRIENDS = '🎲 Оценивать друзей'
VIEW_QUESTION = '✨ Смотреть вопросы'

CLEAR = '👌 Понятно'
TELL_FRIENDS = '👋 Рассказать друзьям'

ANOTHER_QUESTION = '➡️ Другой вопрос'
CHANGE_NAMES = '🔀 Сменить имена'

HOW_CRYSTAL = '🤔 Как заработать кристаллы?'
CONTINUE_NOW = '💎 Продолжить сейчас '

INVITE_FRIEND = '👋 Пригласить друга'
BUY_CRYSTAL = '💎 Купить кристаллы'
BACK_OOPS = 'Назад в упс'
BACK_CRYSTAL = 'Назад в как куп'

BUY_TEMP = '{} 💎 {} руб.'
BUY_TEMP_2 = '{} 💎 {} руб. (выгодней на {}%)'

MY_RATE_BOY = 'Меня оценил 👱‍♂️ '
MY_RATE_GIRL = 'Меня оценила 👩 '
NEW_RATE_TEMP = '(новое)'
POST_RATE_TEMP = '(запрос отправлен)'
RATE_NAME = '({})'

FIND_WHO = '🥷 Узнать кто?'
REQUEST_SEND = '🥷 Запрос отправлен'
AUTHOR = '🥷 Автор: {}'

REVEAL_YOURSELF = 'Раскрыть себя ✅'
REJECT_REQUEST = 'Отклонить запрос ❌'
